PIM_III/01_Gestao_e_Planejamento/DASHBOARD_VISUAL.md
```mermaid
sequenceDiagram
    autonumber
    participant V as Visitante
    participant C as ControladorAutenticacao
    participant A as MD_Alunos
    V->>C: registrar(dados)
    activate C
    C-->>A: <<create>>
    activate A
    A->>A: inicializarPerfil()
    deactivate A
    C-->>V: Cadastro Confirmado
    deactivate C
```
